### Introduction to Pandas Dataframes

# Data frames have five properties
1. __shape__: rows and columns of a dateframe (`df.shape`)
1. __index__: row index of the dataframe, 0 by default (`df.index`)
1. __columns__: column index of the dataframe (`df.columns`)
1. __axes__: row and column indices (`df.axes`)
1. __dtypes__: data types (`df.dtypes`)

In [158]:
import numpy as np
import pandas as pd
import os

# Print out the base path
print(os.getcwd())

/Users/tim/Documents/Github/analyze_this/Scripts

In [166]:
# Set paths that will be called
# Working from the Scripts folder as the base path
exercise_path = '../Python/Exercise Files/Pandas Course Resources/Pandas Course Resources/retail/'

In [ ]:
# To see what is in each different directory
for root, dirs, files in os.walk("."): #or os.walk("..") to start at parent directory
    print("Current Directory:", root)
    print("Subdirectories:", dirs)
    print("Files:", files)
    print("-" * 40)

In [4]:
# You can create a dataframe from a numpy array or a python dictionary
pd.DataFrame(
    {'id':[1, 2], 
    'store_nbr':[1, 2],
    'family':['POULTRY', 'PRODUCE']
    }
)

   id  store_nbr   family
0   1          1  POULTRY
1   2          2  PRODUCE

In [5]:
# Read csv for importing data
oil_path = os.path.join(exercise_path, 'oil.csv')  
oil_df = pd.read_csv(oil_path)
oil_df.shape

(1218, 2)

In [6]:
oil_df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [7]:
oil_df.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [8]:
oil_df.columns = ['price_date', 'oil_price']
oil_df

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [9]:
oil_df.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price_date', 'oil_price'], dtype='object')]

In [10]:
oil_df.dtypes

price_date     object
oil_price     float64
dtype: object

### Exercise: Reading in Transactions data

In [167]:
# What's in the retail folder?
print(f'{os.listdir("../Python/Exercise Files/Pandas Course Resources/Pandas Course Resources/retail/")}')

['retail_2016_2017.csv', '.ipynb_checkpoints', 'transactions.csv', 'oil.csv', 'stores.csv']

In [168]:
# Read in the transactions data from the base path
transactions_path = os.path.join(exercise_path, 'transactions.csv')
transactions = pd.read_csv(transactions_path)
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [37]:
print(f'The size of the data is: {transactions.shape} \n{transactions.columns}\n{transactions.dtypes}')

The size of the data is: (83488, 3)
Index(['date', 'store_nbr', 'transactions'], dtype='object')
date            object
store_nbr        int64
transactions     int64
dtype: object

In [50]:
# There are a couple of key commands we can use to explore what's in a data frame
print(f"""to see the top {transactions.head(2)} \nfor the bottom {transactions.tail(2)}
      \nto grab a sample {transactions.sample(5)}
      \nfor reviewing the information {transactions.info()},
      \nfor details on the data {transactions.describe()}
      """)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB
to see the top          date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
for the bottom              date  store_nbr  transactions
83486  2017-08-15         53           932
83487  2017-08-15         54           802

to grab a sample              date  store_nbr  transactions
2545   2013-02-26         15          1317
31113  2014-10-30         49          2405
33326  2014-12-16          1          2026
1686   2013-02-07         34          2579
26014  2014-07-15         39          1479

for reviewing the information None,

for details on the data           store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [55]:
# Create a random sample with a random state
transactions.sample(100, random_state=42)

             date  store_nbr  transactions
4387   2013-04-07         17          1500
8131   2013-06-26         41           792
37114  2015-03-06         25          1238
74716  2017-03-05         39          1664
75348  2017-03-17         35           726
...           ...        ...           ...
3563   2013-03-20         24          2769
69095  2016-11-17         21           822
32533  2014-11-29         27          1769
27753  2014-08-21         27          1212
54121  2016-02-05         37          1866

[100 rows x 3 columns]

In [56]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [ ]:
# To understand what the different columns look like
transactions.describe(include = 'all').round()

              date  store_nbr  transactions
count        83488    83488.0       83488.0
unique        1682        NaN           NaN
top     2017-07-29        NaN           NaN
freq            54        NaN           NaN
mean           NaN       27.0        1695.0
std            NaN       16.0         963.0
min            NaN        1.0           5.0
25%            NaN       13.0        1046.0
50%            NaN       27.0        1393.0
75%            NaN       40.0        2079.0
max            NaN       54.0        8359.0

In [61]:
# Read in the oil data
oil_path = os.path.join(exercise_path, "oil.csv")
oil = pd.read_csv(oil_path)
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [68]:
oil.describe(include = "all")

              date   dcoilwtico
count         1218  1175.000000
unique        1218          NaN
top     2017-08-31          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

In [64]:
oil.sample(5, random_state=42)

            date  dcoilwtico
541   2015-01-28       44.08
259   2013-12-30       98.90
43    2013-03-01       90.71
1008  2016-11-11       43.39
584   2015-03-30       48.66

In [66]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [67]:
1218 - 1175

43

In [70]:
# Looking at the transactions data
print(f'{transactions.head(5)}')

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [94]:
# Any missing values?
#transactions.isna().sum()
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [72]:
transactions.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [ ]:
# Check if there are any missing values in the data
#transactions.apply(lambda col: col.isnull().any())
# oil.isnull().any()
transactions.isnull().any()
#transactions.date.isnull().any()

np.False_

In [91]:
# How many unique dates?
print(f'{transactions.nunique()}')
transactions.describe(include='all')

date            1682
store_nbr         54
transactions    4993
dtype: int64

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-07-29           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

In [103]:
oil_df[['price_date', 'oil_price']]

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [ ]:
# Access last five rows of oil data frame
oil_df.iloc[-5:, :]

      price_date  oil_price
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

In [111]:
oil_df.loc[:, ['oil_price','price_date']]

      oil_price  price_date
0           NaN  2013-01-01
1         93.14  2013-01-02
2         92.97  2013-01-03
3         93.12  2013-01-04
4         93.20  2013-01-07
...         ...         ...
1213      47.65  2017-08-25
1214      46.40  2017-08-28
1215      46.46  2017-08-29
1216      45.96  2017-08-30
1217      47.26  2017-08-31

[1218 rows x 2 columns]

In [119]:
oil_df['euro_price'] = (oil_df['oil_price']*1.1).round(2)

In [120]:
oil_df.columns

Index(['price_date', 'oil_price', 'euro_price'], dtype='object')

In [ ]:
# Slicing does not work inside the brackets, have to remove them 
oil_df.loc[:,'price_date':'euro_price'].head()

   price_date  oil_price  euro_price
0  2013-01-01        NaN         NaN
1  2013-01-02      93.14      102.45
2  2013-01-03      92.97      102.27
3  2013-01-04      93.12      102.43
4  2013-01-07      93.20      102.52

In [144]:
# remove the 1st entry from the transactions data frame and return a new one
df_trans = transactions.loc[1:, ['store_nbr', 'transactions']].reset_index(drop=True)
df_trans.head()

   store_nbr  transactions
0          1          2111
1          2          2358
2          3          3487
3          4          1922
4          5          1903

In [ ]:
# How many unique store numbers?
print(f'There are {df_trans['store_nbr'].nunique()} distinct stores')
tot_trans = (df_trans['transactions'].sum()/1e6).round(6)
print(f'There are {tot_trans:,} total transactions')

There are 54 distinct stores.
There are 141.478175 total transactions

### Dropping Data
USe the `.drop()` function to drop columns or rows. Use the axes to specify whether the action should be done on rows or columns. 
**`inplace=True`** use with caution, as this will modify the data from upon which the action has been called. 

### Duplicates
Use the `.duplcated()` function to return a boolean on whether or not duplicates exist. The `subset` argument is used to specify a column or set of columns.
Use the `.drop_duplicates(..., subset = ..., keep = (first, last), ignore_index=True)` to drop duplicates, keep the first or last one, and reset the index.

In [ ]:
transactions = transactions.drop(0, axis = 0)
#transactions.drop(0, axis = 0, inplace=True)
transactions.head()

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [172]:
# drop the date column
transactions.drop('date', axis = 1).head()

   store_nbr  transactions
1          1          2111
2          2          2358
3          3          3487
4          4          1922
5          5          1903

In [174]:
# Get a data frame that only includes the last row for each store
transactions.drop_duplicates(subset = 'store_nbr', keep = 'last', ignore_index=True).head()

         date  store_nbr  transactions
0  2017-08-15          1          1693
1  2017-08-15          2          1737
2  2017-08-15          3          2956
3  2017-08-15          4          1283
4  2017-08-15          5          1310

### Handling Missing data
Can use `.dropna()` or `.fillna()` methods to deal with missing data
`product_df.fillna({"price":0})` uses a dictionary to fill all missing values of the price column with 0s. This can be really useful.

In [180]:
product_df = pd.DataFrame(
    {'product':[pd.NA, 'Dairy', 'Dairy', pd.NA, 'Fruits'], 
    'price':[2.56, pd.NA, 4.55, 2.74, pd.NA]
    }
)
product_df

  product price
0    <NA>  2.56
1   Dairy  <NA>
2   Dairy  4.55
3    <NA>  2.74
4  Fruits  <NA>

In [181]:
product_df.fillna(0)

/var/folders/y7/p6k2fh7s3rz0qzq7d9hkljkw0000gn/T/ipykernel_35925/3271226303.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  product_df.fillna(0)

  product  price
0       0   2.56
1   Dairy   0.00
2   Dairy   4.55
3       0   2.74
4  Fruits   0.00

In [182]:
product_df.fillna({"price": 0})

/var/folders/y7/p6k2fh7s3rz0qzq7d9hkljkw0000gn/T/ipykernel_35925/2715920973.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  product_df.fillna({"price": 0})

  product  price
0    <NA>   2.56
1   Dairy   0.00
2   Dairy   4.55
3    <NA>   2.74
4  Fruits   0.00

In [237]:
oil_path = os.path.join(exercise_path, 'oil.csv')  
oil_df = pd.read_csv(oil_path, parse_dates=['date'])

oil_df.info()
oil_df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

date           0
dcoilwtico    43
dtype: int64

In [ ]:
#Two ways to fill the missing values with zero and them return the mean of the price series
print(f'{oil_df.loc[:, 'dcoilwtico'].fillna(0).mean()}')
print(f'{oil_df['dcoilwtico'].fillna(0).mean()}')

65.32379310344828
65.32379310344828

In [212]:
print(f'{oil_df['dcoilwtico'].fillna(oil_df['dcoilwtico'].mean()).mean()}')

67.71436595744682

In [216]:
oil_df['dcoilwtico'].mean()

np.float64(67.71436595744682)

### Filtering
We can filter a data frame by passing a logical test into the .loc[] accessor
`retail_df.loc[retail_df["date"] == "2016-10-28"]` # will filter the dataframe to all rows where the data is Oct 28, 2016

We can also have a row filter and columnn filter in the loc accessor:
`retail_df.loc[retail_df["date"] == "2016-10-28", ["date", "sales"]].head()`

In [240]:
oil_df['benchmark'] = 100
oil_df.loc[oil_df['dcoilwtico'] > oil_df['benchmark']]

          date  dcoilwtico  benchmark
131 2013-07-03      101.92        100
133 2013-07-05      103.09        100
134 2013-07-08      103.03        100
135 2013-07-09      103.46        100
136 2013-07-10      106.41        100
..         ...         ...        ...
407 2014-07-24      102.76        100
408 2014-07-25      105.23        100
409 2014-07-28      105.68        100
410 2014-07-29      104.91        100
411 2014-07-30      104.29        100

[182 rows x 3 columns]

In [232]:
# Filter to only when the year is 2013
oil_mask = (oil_df['dcoilwtico'] > oil_df['benchmark']) & (oil_df['date'].str[0:4] == "2013")
oil_df.loc[oil_mask]

           date  dcoilwtico  benchmark
131  2013-07-03      101.92        100
133  2013-07-05      103.09        100
134  2013-07-08      103.03        100
135  2013-07-09      103.46        100
136  2013-07-10      106.41        100
..          ...         ...        ...
204  2013-10-14      102.46        100
205  2013-10-15      101.15        100
206  2013-10-16      102.34        100
207  2013-10-17      100.72        100
208  2013-10-18      100.87        100

[76 rows x 3 columns]

In [241]:
# Let's use boolean logic to recreate filtering conditions from last demo
oil_df.query("dcoilwtico > benchmark or date.dt.year == 2013")

          date  dcoilwtico  benchmark
0   2013-01-01         NaN        100
1   2013-01-02       93.14        100
2   2013-01-03       92.97        100
3   2013-01-04       93.12        100
4   2013-01-07       93.20        100
..         ...         ...        ...
407 2014-07-24      102.76        100
408 2014-07-25      105.23        100
409 2014-07-28      105.68        100
410 2014-07-29      104.91        100
411 2014-07-30      104.29        100

[367 rows x 3 columns]

In [266]:
# Practice: What is the percentage of times all stores had more than 2000 transactions
transactions.head()
#transactions.shape[0]
#(transactions.loc[transactions['transactions'] > 2000]).count() / transactions.shape[0]

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [278]:
transactions_path = os.path.join(exercise_path, 'transactions.csv')
transactions = pd.read_csv(transactions_path, parse_dates=['date'])
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [265]:
# Practice: What is the percentage of times all stores had more than 2000 transactions
tot_trans = transactions.shape[0]
transactions.query("transactions > 2000").count() / tot_trans

date            0.266808
store_nbr       0.266808
transactions    0.266808
dtype: float64

In [ ]:
# Can take the average of the boolean condition to get the percentage of times a condition was met
(transactions["transactions"] > 2000).mean()

np.float64(0.26680481027213493)

In [269]:
store_25 = transactions.query("store_nbr ==25").count()
count_25 = transactions.query("store_nbr == 25 & transactions > 2000").count()
sum_25 = transactions.query("store_nbr == 25 & transactions > 2000").sum()

print(f'Store 25 had {store_25} tranactions, of which {count_25/store_25} were above 2000\n and {sum_25} was the total')

Store 25 had date            1614
store_nbr       1614
transactions    1614
dtype: int64 tranactions, of which date            0.034696
store_nbr       0.034696
transactions    0.034696
dtype: float64 were above 2000
 and date            2013-02-092013-02-102013-02-112013-03-022013-0...
store_nbr                                                    1400
transactions                                               144903
dtype: object was the total

In [316]:
store_25_mask = (transactions['store_nbr'] == 25) &  (transactions["transactions"] > 2000)
transactions.loc[store_25_mask, 'transactions'].count()

np.int64(56)

In [ ]:
# Sum the transactions for stores 25 and 31 that occured in May or June and had less than 2000 transactions
subset_trans = transactions.query("store_nbr in [25, 31] and (date.dt.month == 5 | date.dt.month == 6) and transactions < 2000")
print(f'{subset_trans['transactions'].sum()}')

644910

In [309]:
#Filtering without the query method
mask = (transactions['store_nbr'].isin([25, 31])) & (transactions['date'].astype('string').str[6:7].isin(['5', '6'])) & (transactions['transactions'] < 2000)
transactions.loc[mask]['transactions'].sum()

np.int64(644910)

In [323]:
oil_df

           date  dcoilwtico  benchmark
0    2013-01-01         NaN        100
1    2013-01-02       93.14        100
2    2013-01-03       92.97        100
3    2013-01-04       93.12        100
4    2013-01-07       93.20        100
...         ...         ...        ...
1213 2017-08-25       47.65        100
1214 2017-08-28       46.40        100
1215 2017-08-29       46.46        100
1216 2017-08-30       45.96        100
1217 2017-08-31       47.26        100

[1218 rows x 3 columns]

In [324]:
oil_df.sort_index(ascending=False)

           date  dcoilwtico  benchmark
1217 2017-08-31       47.26        100
1216 2017-08-30       45.96        100
1215 2017-08-29       46.46        100
1214 2017-08-28       46.40        100
1213 2017-08-25       47.65        100
...         ...         ...        ...
4    2013-01-07       93.20        100
3    2013-01-04       93.12        100
2    2013-01-03       92.97        100
1    2013-01-02       93.14        100
0    2013-01-01         NaN        100

[1218 rows x 3 columns]

In [326]:
oil_df.sort_index(axis = 1)

      benchmark       date  dcoilwtico
0           100 2013-01-01         NaN
1           100 2013-01-02       93.14
2           100 2013-01-03       92.97
3           100 2013-01-04       93.12
4           100 2013-01-07       93.20
...         ...        ...         ...
1213        100 2017-08-25       47.65
1214        100 2017-08-28       46.40
1215        100 2017-08-29       46.46
1216        100 2017-08-30       45.96
1217        100 2017-08-31       47.26

[1218 rows x 3 columns]

In [339]:
# What are the five days with the highest transaction counts?
transactions.sort_values(['transactions'], ascending=False).iloc[:5]

            date  store_nbr  transactions
52011 2015-12-23         44          8359
71010 2016-12-23         44          8307
16570 2013-12-23         44          8256
33700 2014-12-23         44          8120
16572 2013-12-23         46          8001

In [342]:
transactions.sort_values(['date', 'transactions'], ascending=[True, False]).iloc[1:6]

         date  store_nbr  transactions
40 2013-01-02         46          4886
38 2013-01-02         44          4821
39 2013-01-02         45          4208
41 2013-01-02         47          4161
11 2013-01-02         11          3547

In [ ]:
transactions.sort_index(axis = 1)

            date  store_nbr  transactions
0     2013-01-01         25           770
1     2013-01-02          1          2111
2     2013-01-02          2          2358
3     2013-01-02          3          3487
4     2013-01-02          4          1922
...          ...        ...           ...
83483 2017-08-15         50          2804
83484 2017-08-15         51          1573
83485 2017-08-15         52          2255
83486 2017-08-15         53           932
83487 2017-08-15         54           802

[83488 rows x 3 columns]

### Modifying columns

In [345]:
transactions.columns = ['date', 'store_number', 'transaction_count']
transactions.head()

        date  store_number  transaction_count
0 2013-01-01            25                770
1 2013-01-02             1               2111
2 2013-01-02             2               2358
3 2013-01-02             3               3487
4 2013-01-02             4               1922

In [348]:
# Reindex the order of the columns for a particular order
transactions.reindex(labels = ['date', 'transaction_count', 'store_number'], axis = 1).head()

        date  transaction_count  store_number
0 2013-01-01                770            25
1 2013-01-02               2111             1
2 2013-01-02               2358             2
3 2013-01-02               3487             3
4 2013-01-02               1922             4

In [349]:
oil_df['benchmark'] < 100

0       False
1       False
2       False
3       False
4       False
        ...
1213    False
1214    False
1215    False
1216    False
1217    False
Name: benchmark, Length: 1218, dtype: bool

In [350]:
# Transactions bonus calculations
transactions['pct_to_target'] = transactions['transaction_count']/2500
transactions

            date  store_number  transaction_count  pct_to_target
0     2013-01-01            25                770         0.3080
1     2013-01-02             1               2111         0.8444
2     2013-01-02             2               2358         0.9432
3     2013-01-02             3               3487         1.3948
4     2013-01-02             4               1922         0.7688
...          ...           ...                ...            ...
83483 2017-08-15            50               2804         1.1216
83484 2017-08-15            51               1573         0.6292
83485 2017-08-15            52               2255         0.9020
83486 2017-08-15            53                932         0.3728
83487 2017-08-15            54                802         0.3208

[83488 rows x 4 columns]

In [368]:
# Create a met column that is true if pct_to_target is greater than or equal to 1
transactions['met_target'] = transactions['pct_to_target'] >= 1
transactions.head()

,date,store_number,transaction_count,pct_to_target,met_target,bonus_payable,month,day
0,2013-01-01,25,770,0.3080,False,0,1,1
1,2013-01-02,1,2111,0.8444,False,0,1,2
2,2013-01-02,2,2358,0.9432,False,0,1,2
3,2013-01-02,3,3487,1.3948,True,100,1,2
4,2013-01-02,4,1922,0.7688,False,0,1,2

In [ ]:
# Create a bonus payable column that equals 100- if met_target is true and 0 if not
# Can also multiple by the boolean to get answer
#transactions['bonus_payable'] = transactions['met_target'] * 100
transactions['bonus_payable'] = np.where(transactions['met_target'] == True, 100, 0)
transactions['month'] = transactions[date].date.dt.month

,date,store_number,transaction_count,pct_to_target,met_target,bonus_payable
0,2013-01-01,25,770,0.3080,False,0
1,2013-01-02,1,2111,0.8444,False,0
2,2013-01-02,2,2358,0.9432,False,0
3,2013-01-02,3,3487,1.3948,True,100
4,2013-01-02,4,1922,0.7688,False,0
...,...,...,...,...,...,...
83483,2017-08-15,50,2804,1.1216,True,100
83484,2017-08-15,51,1573,0.6292,False,0
83485,2017-08-15,52,2255,0.9020,False,0
83486,2017-08-15,53,932,0.3728,False,0
83487,2017-08-15,54,802,0.3208,False,0

In [360]:
transactions['bonus_payable'].sum()

np.int64(1448300)

In [367]:
transactions['month'] = transactions['date'].dt.month
transactions['day'] = transactions['date'].dt.dayofweek
transactions.head()

,date,store_number,transaction_count,pct_to_target,met_target,bonus_payable,month,day
0,2013-01-01,25,770,0.3080,False,0,1,1
1,2013-01-02,1,2111,0.8444,False,0,1,2
2,2013-01-02,2,2358,0.9432,False,0,1,2
3,2013-01-02,3,3487,1.3948,True,100,1,2
4,2013-01-02,4,1922,0.7688,False,0,1,2

In [ ]:
# Using np.selet to mimick a case_when statement

conditions = [
    (oil_df['dcoilwtico'] > 100), 
    (oil_df['dcoilwtico'].between(50, 100)),
    (oil_df['dcoilwtico'] < 50)
]
choices = ['Dont Buy', 'Buy', 'Strong Buy']

oil_df['buy'] = np.select(conditions, choices, default='Missing')
oil_df

           date  dcoilwtico  benchmark         buy
0    2013-01-01         NaN        100     Missing
1    2013-01-02       93.14        100         Buy
2    2013-01-03       92.97        100         Buy
3    2013-01-04       93.12        100         Buy
4    2013-01-07       93.20        100         Buy
...         ...         ...        ...         ...
1213 2017-08-25       47.65        100  Strong Buy
1214 2017-08-28       46.40        100  Strong Buy
1215 2017-08-29       46.46        100  Strong Buy
1216 2017-08-30       45.96        100  Strong Buy
1217 2017-08-31       47.26        100  Strong Buy

[1218 rows x 4 columns]

In [377]:
oil_df['buy'].value_counts()

buy
Buy           512
Strong Buy    481
Dont Buy      182
Missing        43
Name: count, dtype: int64

In [379]:
transactions.head()

,date,store_number,transaction_count,pct_to_target,met_target,bonus_payable,month,day
0,2013-01-01,25,770,0.3080,False,0,1,1
1,2013-01-02,1,2111,0.8444,False,0,1,2
2,2013-01-02,2,2358,0.9432,False,0,1,2
3,2013-01-02,3,3487,1.3948,True,100,1,2
4,2013-01-02,4,1922,0.7688,False,0,1,2

In [391]:
# Create a seasonal_bonus column
condition = [
    (transactions['month'] == 12),
    (transactions['month'] == 5) & (transactions['day'] == 6),
    (transactions['month'] == 7) & (transactions['day'] == 0)
]

choices = ["Holiday Bonus", "Corporate Month", "Summer Special"]

transactions["seasonal_bonus"] = np.select(condition, choices, default = "None")
transactions["seasonal_bonus"].value_counts()

seasonal_bonus
None               75259
Holiday Bonus       6028
Summer Special      1103
Corporate Month     1098
Name: count, dtype: int64

In [392]:
((transactions['seasonal_bonus'] != "None")*100).sum()

np.int64(822900)